#!/bin/bash

./block send  张三 李四 10 矿工 "张三转李四 10 比特币"
./block send  张三 王五 20 矿工 "张三转王五 20 比特币"
./checkBalance.sh

echo "========================================================================================"
./block send  王五 李四 2 矿工 "王五转李四 2 比特币"
./block send  王五 李四 3 矿工 "王五转李四 3 比特币"
./block send  王五 张三 5 矿工 "王五转张三 5 比特币"
./checkBalance.sh

echo "========================================================================================"
./block send  李四 赵六 14 矿工 "李四转赵六 14 比特币"
./checkBalance.sh

